In [1]:
import pandas as pd
import numpy as np
from pathlib import Path

In [2]:
df = pd.read_csv('/Users/laviniaantonino/Library/Mobile Documents/com~apple~CloudDocs/MSc Business Analytics/S2 Trimester 3/Machine Learning /dataset ML Project.csv')

# Quick overview
print(df.shape)
df.head()

(4424, 35)

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,1,8,5,2,1,1,1,13,10,6,...,0,0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,1,6,1,11,1,1,1,1,3,4,...,0,6,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,1,1,5,5,1,1,1,22,27,10,...,0,6,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,1,8,2,15,1,1,1,23,27,6,...,0,6,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,2,12,1,3,0,1,1,22,28,10,...,0,6,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [3]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4424 entries, 0 to 4423
Data columns (total 35 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Marital status                                  4424 non-null   int64
 1   Application mode                                4424 non-null   int64
 2   Application order                               4424 non-null   int64
 3   Course                                          4424 non-null   int64
 4   Daytime/evening attendance                      4424 non-null   int64
 5   Previous qualification                          4424 non-null   int64
 6   Nacionality                                     4424 non-null   int64
 7   Mother's qualification                          4424 non-null   int64
 8   Father's qualification                          4424 non-null   int64
 9   Mother's occupation                             4424 non-null   int64
 10  Father's occupation                             4424 non-null   int64
 11  Displaced                                       4424 non-null   int64
 12  Educational special needs                       4424 non-null   int64
 13  Debtor                                          4424 non-null   int64
 14  Tuition fees up to date                         4424 non-null   int64
 15  Gender                                          4424 non-null   int64
 16  Scholarship holder                              4424 non-null   int64
 17  Age at enrollment                               4424 non-null   int64
 18  International                                   4424 non-null   int64
 19  Curricular units 1st sem (credited)             4424 non-null   int64
 20  Curricular units 1st sem (enrolled)             4424 non-null   int64
 21  Curricular units 1st sem (evaluations)          4424 non-null   int64
 22  Curricular units 1st sem (approved)             4424 non-null   int64
 23  Curricular units 1st sem (grade)                4424 non-null   float64
 24  Curricular units 1st sem (without evaluations)  4424 non-null   int64
 25  Curricular units 2nd sem (credited)             4424 non-null   int64
 26  Curricular units 2nd sem (enrolled)             4424 non-null   int64
 27  Curricular units 2nd sem (evaluations)          4424 non-null   int64
 28  Curricular units 2nd sem (approved)             4424 non-null   int64
 29  Curricular units 2nd sem (grade)                4424 non-null   float64
 30  Curricular units 2nd sem (without evaluations)  4424 non-null   int64
 31  Unemployment rate                               4424 non-null   float64
 32  Inflation rate                                  4424 non-null   float64
 33  GDP                                             4424 non-null   float64
 34  Target                                          4424 non-null   object
dtypes: float64(5), int64(29), object(1)
memory usage: 1.2+ MB

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 1st sem (without evaluations),Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP
count,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,...,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000,4424.000000
mean,1.178571,6.886980,1.727848,9.899186,0.890823,2.531420,1.254521,12.322107,16.455244,7.317812,...,0.137658,0.541817,6.232143,8.063291,4.435805,10.230206,0.150316,11.566139,1.228029,0.001969
std,0.605747,5.298964,1.313793,4.331792,0.311897,3.963707,1.748447,9.026251,11.044800,3.997828,...,0.690880,1.918546,2.195951,3.947951,3.014764,5.210808,0.753774,2.663850,1.382711,2.269935
min,1.000000,1.000000,0.000000,1.000000,0.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,7.600000,-0.800000,-4.060000
25%,1.000000,1.000000,1.000000,6.000000,1.000000,1.000000,1.000000,2.000000,3.000000,5.000000,...,0.000000,0.000000,5.000000,6.000000,2.000000,10.750000,0.000000,9.400000,0.300000,-1.700000
50%,1.000000,8.000000,1.000000,10.000000,1.000000,1.000000,1.000000,13.000000,14.000000,6.000000,...,0.000000,0.000000,6.000000,8.000000,5.000000,12.200000,0.000000,11.100000,1.400000,0.320000
75%,1.000000,12.000000,2.000000,13.000000,1.000000,1.000000,1.000000,22.000000,27.000000,10.000000,...,0.000000,0.000000,7.000000,10.000000,6.000000,13.333333,0.000000,13.900000,2.600000,1.790000
max,6.000000,18.000000,9.000000,17.000000,1.000000,17.000000,21.000000,29.000000,34.000000,32.000000,...,12.000000,19.000000,23.000000,33.000000,20.000000,18.571429,12.000000,16.200000,3.700000,3.510000

In [4]:
# Identify all Semester 2 variables
sem2_cols = [col for col in df.columns if '2nd' in col.lower()]

print("Semester 2 columns removed:")
print(sem2_cols)

# Drop them
df = df.drop(columns=sem2_cols)

Semester 2 columns removed:
['Curricular units 2nd sem (credited)', 'Curricular units 2nd sem (enrolled)', 'Curricular units 2nd sem (evaluations)', 'Curricular units 2nd sem (approved)', 'Curricular units 2nd sem (grade)', 'Curricular units 2nd sem (without evaluations)']

In [5]:
# Shape after removing Semester 2 variables
print("Shape after removing 2nd semester variables:", df.shape)

Shape after removing 2nd semester variables: (4424, 29)

In [6]:
columns_to_keep = [
    'Curricular units 1st sem (grade)',
    'Curricular units 1st sem (approved)',
    'Tuition fees up to date',
    'Scholarship holder',
    'Age at enrollment',
    'Displaced',
    'Previous qualification',
    'Debtor',
    'Application mode',
    'Target'
]

df = df[columns_to_keep].copy()

df.head()

,Curricular units 1st sem (grade),Curricular units 1st sem (approved),Tuition fees up to date,Scholarship holder,Age at enrollment,Displaced,Previous qualification,Debtor,Application mode,Target
0,0.000000,0,1,0,20,1,1,0,8,Dropout
1,14.000000,6,0,0,19,1,1,0,6,Graduate
2,0.000000,0,0,0,19,1,1,0,1,Dropout
3,13.428571,6,1,0,20,1,1,0,8,Graduate
4,12.333333,5,1,0,45,0,1,0,12,Graduate

In [7]:
df['Target'] = df['Target'].map({
    'Dropout': 1,
    'Graduate': 0,
    'Enrolled': 0
})

df['Target'].value_counts()

Target
0    3003
1    1421
Name: count, dtype: int64

In [8]:
df = df[df['Target'].notna()]

In [9]:
df.isnull().sum()

Curricular units 1st sem (grade)       0
Curricular units 1st sem (approved)    0
Tuition fees up to date                0
Scholarship holder                     0
Age at enrollment                      0
Displaced                              0
Previous qualification                 0
Debtor                                 0
Application mode                       0
Target                                 0
dtype: int64

In [10]:
print("Duplicates:", df.duplicated().sum())
df = df.drop_duplicates()

Duplicates: 563

In [11]:
df['Application mode'] = df['Application mode'].astype('category')
df['Previous qualification'] = df['Previous qualification'].astype('category')

df = pd.get_dummies(df, columns=[
    'Application mode',
    'Previous qualification'
], drop_first=True)

In [12]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 3861 entries, 0 to 4423
Data columns (total 41 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   Curricular units 1st sem (grade)     3861 non-null   float64
 1   Curricular units 1st sem (approved)  3861 non-null   int64
 2   Tuition fees up to date              3861 non-null   int64
 3   Scholarship holder                   3861 non-null   int64
 4   Age at enrollment                    3861 non-null   int64
 5   Displaced                            3861 non-null   int64
 6   Debtor                               3861 non-null   int64
 7   Target                               3861 non-null   int64
 8   Application mode_2                   3861 non-null   bool
 9   Application mode_3                   3861 non-null   bool
 10  Application mode_4                   3861 non-null   bool
 11  Application mode_5                   3861 non-null   bool
 12  Application mode_6                   3861 non-null   bool
 13  Application mode_7                   3861 non-null   bool
 14  Application mode_8                   3861 non-null   bool
 15  Application mode_9                   3861 non-null   bool
 16  Application mode_10                  3861 non-null   bool
 17  Application mode_11                  3861 non-null   bool
 18  Application mode_12                  3861 non-null   bool
 19  Application mode_13                  3861 non-null   bool
 20  Application mode_14                  3861 non-null   bool
 21  Application mode_15                  3861 non-null   bool
 22  Application mode_16                  3861 non-null   bool
 23  Application mode_17                  3861 non-null   bool
 24  Application mode_18                  3861 non-null   bool
 25  Previous qualification_2             3861 non-null   bool
 26  Previous qualification_3             3861 non-null   bool
 27  Previous qualification_4             3861 non-null   bool
 28  Previous qualification_5             3861 non-null   bool
 29  Previous qualification_6             3861 non-null   bool
 30  Previous qualification_7             3861 non-null   bool
 31  Previous qualification_8             3861 non-null   bool
 32  Previous qualification_9             3861 non-null   bool
 33  Previous qualification_10            3861 non-null   bool
 34  Previous qualification_11            3861 non-null   bool
 35  Previous qualification_12            3861 non-null   bool
 36  Previous qualification_13            3861 non-null   bool
 37  Previous qualification_14            3861 non-null   bool
 38  Previous qualification_15            3861 non-null   bool
 39  Previous qualification_16            3861 non-null   bool
 40  Previous qualification_17            3861 non-null   bool
dtypes: bool(33), float64(1), int64(7)
memory usage: 395.9 KB

,Curricular units 1st sem (grade),Curricular units 1st sem (approved),Tuition fees up to date,Scholarship holder,Age at enrollment,Displaced,Debtor,Target
count,3861.000000,3861.000000,3861.000000,3861.000000,3861.000000,3861.000000,3861.000000,3861.000000
mean,11.277344,5.014763,0.876198,0.261072,23.670034,0.529656,0.125097,0.306656
std,4.220135,3.021433,0.329398,0.439276,7.831609,0.499184,0.330872,0.461165
min,0.000000,0.000000,0.000000,0.000000,17.000000,0.000000,0.000000,0.000000
25%,11.333333,4.000000,1.000000,0.000000,19.000000,0.000000,0.000000,0.000000
50%,12.400000,5.000000,1.000000,0.000000,20.000000,1.000000,0.000000,0.000000
75%,13.471429,6.000000,1.000000,1.000000,26.000000,1.000000,0.000000,1.000000
max,18.875000,26.000000,1.000000,1.000000,70.000000,1.000000,1.000000,1.000000

In [13]:
df.to_csv("student_cleaned.csv", index=False)
print("Cleaned dataset saved successfully.")

Cleaned dataset saved successfully.